artillery/smoke-test.yml
# SmellPin Artillery 冒烟测试配置
# 快速验证基本功能是否正常

config:
  target: 'http://localhost:3001'
  phases:
    - duration: 30    # 30秒
      arrivalRate: 1  # 每秒1个用户
      name: "Smoke test"

  http:
    timeout: 10

  ensure:
    thresholds:
      - http.response_time.p95: 2000
      - http.codes.200: 0.9

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          name: "Health Check"
          expect:
            - statusCode: 200

  - name: "API Health Check"
    weight: 20  
    flow:
      - get:
          url: "/api/v1/health"
          name: "API Health Check"
          expect:
            - statusCode: 200

  - name: "Basic User Flow"
    weight: 30
    flow:
      - post:
          url: "/api/v1/users/register"
          json:
            username: "smoke_{{ $randomString() }}"
            email: "smoke_{{ $randomString() }}@smellpin.test"
            password: "SmokeTest123!"
          expect:
            - statusCode: 201

  - name: "Basic Annotation Query"
    weight: 30
    flow:
      - get:
          url: "/api/v1/annotations/list"
          qs:
            limit: 5
          expect:
            - statusCode: 200