artillery/stress-test.yml
# SmellPin Artillery 压力测试配置
# 高负载压力测试，模拟大量并发用户

config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60    # 预热1分钟
      arrivalRate: 10
      name: "Stress warm up"
    
    - duration: 300   # 压力测试5分钟
      arrivalRate: 30
      rampTo: 100     # 逐步增加到每秒100个用户
      name: "Stress ramp up"
    
    - duration: 600   # 持续压力10分钟
      arrivalRate: 100
      name: "Sustained stress"
    
    - duration: 120   # 降级2分钟
      arrivalRate: 100
      rampTo: 10
      name: "Stress ramp down"

  http:
    timeout: 45
    pool: 100

  ensure:
    thresholds:
      - http.response_time.p95: 3000  # 放宽响应时间要求
      - http.response_time.p99: 5000
      - http.codes.200: 0.9           # 90%成功率
      - http.codes.5xx: 0.05          # 5%服务器错误率

scenarios:
  # 高并发用户注册场景
  - name: "Concurrent User Registration"
    weight: 15
    flow:
      - post:
          url: "/api/v1/users/register"
          name: "Stress Register"
          json:
            username: "stress_{{ $randomString() }}_{{ timestamp }}"
            email: "stress_{{ $randomString() }}_{{ timestamp }}@smellpin.test"
            password: "StressTest123!"
            firstName: "压力测试用户"
          capture:
            - json: "$.data.id"
              as: "userId"
          expect:
            - statusCode: [201, 400] # 允许一些验证错误

  # 高并发标注创建
  - name: "Concurrent Annotation Creation"  
    weight: 25
    flow:
      # 快速登录
      - post:
          url: "/api/v1/users/login"
          json:
            email: "existing_user@smellpin.test"
            password: "password123"
          capture:
            - json: "$.data.token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]

      - think: 0.5  # 减少思考时间

      # 快速创建标注
      - post:
          url: "/api/v1/annotations"
          name: "Stress Create Annotation"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "压力测试_{{ timestamp }}_{{ $randomString() }}"
            description: "高并发压力测试标注"
            smellType: "{{ $randomItem(['食物香味', '垃圾异味', '化学品味']) }}"
            intensity: "{{ $randomInt(1, 5) }}"
            latitude: "{{ $randomFloat(39.85, 39.95) }}"
            longitude: "{{ $randomFloat(116.35, 116.45) }}"
          expect:
            - statusCode: [201, 400, 401, 429] # 允许各种响应

  # 高频查询场景
  - name: "High Frequency Queries"
    weight: 35
    flow:
      # 并发列表查询
      - get:
          url: "/api/v1/annotations/list"
          name: "Stress List Query"
          qs:
            page: "{{ $randomInt(1, 10) }}"
            limit: "{{ $randomInt(10, 50) }}"
            sortBy: "{{ $randomItem(['created_at', 'like_count', 'intensity']) }}"
          expect:
            - statusCode: [200, 404, 500]

      # 并发地理查询
      - get:
          url: "/api/v1/annotations/nearby"
          name: "Stress Geo Query"
          qs:
            latitude: "{{ $randomFloat(39.8, 40.0) }}"
            longitude: "{{ $randomFloat(116.3, 116.5) }}"
            radius: "{{ $randomInt(1000, 10000) }}"
            limit: "{{ $randomInt(5, 20) }}"
          expect:
            - statusCode: [200, 400, 500]

  # 数据库压力场景
  - name: "Database Stress Operations"
    weight: 25
    flow:
      # 复杂搜索查询
      - get:
          url: "/api/v1/search"
          name: "Stress Search"
          qs:
            q: "{{ $randomItem(['测试', '食物', '垃圾', '香味', '北京']) }}"
            type: "annotations"
            limit: "{{ $randomInt(10, 50) }}"
            filters: "intensity:{{ $randomInt(1, 5) }}"
          expect:
            - statusCode: [200, 400, 500]

      - think: 0.2

      # 统计查询
      - get:
          url: "/api/v1/annotations/stats"
          name: "Stress Stats Query"
          qs:
            period: "{{ $randomItem(['day', 'week', 'month']) }}"
            groupBy: "{{ $randomItem(['smell_type', 'intensity', 'location']) }}"
          expect:
            - statusCode: [200, 500]